In [1]:
import pandas as pd

In [4]:
pd.read_excel('for candidate.xlsx')

,Age,Name,Attrition,BusinessTravel,DailyRate,Department,MonthlyIncome
0,41,Jack,Yes,Travel_Rarely,1102,Sales,5993
1,49,Will,No,Travel_Frequently,279,Research & Development,5130
2,37,Bryan,Yes,Travel_Rarely,1373,Research & Development,2090
3,33,Adam,No,Travel_Frequently,1392,Research & Development,2909
4,27,Jonny,No,Travel_Rarely,591,Research & Development,3468
5,53,William,No,Travel_Rarely,1219,Sales,15427
6,38,Joe,No,Travel_Rarely,371,Research & Development,3944
7,24,Stefan,No,Non-Travel,673,Research & Development,4011

In [5]:
df = pd.read_excel('for candidate.xlsx')

In [6]:
pd.pivot_table(df, index= 'Department', values = 'MonthlyIncome')

                        MonthlyIncome
Department
Research & Development           3592
Sales                           10710

In [7]:
pd.pivot_table(df, index= 'Department', values = 'MonthlyIncome', aggfunc = ('mean','rank'))

                           mean  rank
Research & Development   3592.0   NaN
Sales                   10710.0   NaN
0                           NaN   1.0
1                           NaN   6.0
2                           NaN   1.0
3                           NaN   2.0
4                           NaN   3.0
5                           NaN   2.0
6                           NaN   4.0
7                           NaN   5.0

In [8]:
df2 = pd.pivot_table(df, index= 'Department', values = 'MonthlyIncome')

In [10]:
pd.pivot_table(df2, values = 'MonthlyIncome', aggfunc = ('rank'))

ValueError: No group keys passed!

In [14]:
df2['MonthlyIncomeRank']= df2['MonthlyIncome'].rank(ascending = False)

In [12]:
df2

                        MonthlyIncome  MonthlyIncomeRank
Department
Research & Development           3592                1.0
Sales                           10710                2.0

In [15]:
df2

                        MonthlyIncome  MonthlyIncomeRank
Department
Research & Development           3592                2.0
Sales                           10710                1.0